tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# The fastest shell plugin manager
brew "antidote"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# MySQL
brew "mysql"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
brew "starship"
# AWS Build Tools
brew "terraform"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
cask "alfred"
cask "brave-browser"
cask "dropbox"
cask "docker"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "gitkraken"
cask "google-chrome"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "visual-studio-code"
cask "vlc"

mas "iHosts", id: 1102004240
mas "Vectornator: Design Software", id: 1219074514
mas "Logic Pro", id: 634148309
mas "Final Cut Pro", id: 424389933
mas "Sequel Ace", id: 1518036000
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
mas "Spark", id: 1176895641
